Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/edc/PIC32MM0256GPM036.PIC
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ErrorEPC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="ErrorEPC" edc:nmmrflags="0t" edc:nmmrid="248" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ErrorEPC" edc:desc="" edc:mask="0xffffffff" edc:name="ErrorEPC" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DESAVE" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="DESAVE" edc:nmmrflags="0t" edc:nmmrid="252" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DESAVE" edc:desc="" edc:mask="0xffffffff" edc:name="DESAVE" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="lo" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="lo" edc:nmmrflags="St" edc:nmmrid="1152" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUlow" edc:desc="" edc:mask="0xffffffff" edc:name="MDUlow" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="hi" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="hi" edc:nmmrflags="St" edc:nmmrid="1156" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUhigh" edc:desc="" edc:mask="0xffffffff" edc:name="MDUhigh" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="lo1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="lo1" edc:nmmrflags="St" edc:nmmrid="1160" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUlow" edc:desc="" edc:mask="0xffffffff" edc:name="MDUlow" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="hi1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="hi1" edc:nmmrflags="St" edc:nmmrid="1164" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUhigh" edc:desc="" edc:mask="0xffffffff" edc:name="MDUhigh" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="lo2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="lo2" edc:nmmrflags="St" edc:nmmrid="1168" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUlow" edc:desc="" edc:mask="0xffffffff" edc:name="MDUlow" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="hi2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="hi2" edc:nmmrflags="St" edc:nmmrid="1172" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUhigh" edc:desc="" edc:mask="0xffffffff" edc:name="MDUhigh" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="lo3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="lo3" edc:nmmrflags="St" edc:nmmrid="1176" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUlow" edc:desc="" edc:mask="0xffffffff" edc:name="MDUlow" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_begin="0x0" edc:_end="0x134" edc:_modsrc="32xxxx-M14K-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="hi3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="hi3" edc:nmmrflags="St" edc:nmmrid="1180" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUhigh" edc:desc="" edc:mask="0xffffffff" edc:name="MDUhigh" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:NMMRPlace>
    <edc:EmulatorSector edc:beginaddr="0xff300000" edc:endaddr="0xff400000" edc:regionid="emulation"/>
    <edc:DeviceIDSector edc:_mask="0x0fffffff" edc:beginaddr="0xbf803660" edc:endaddr="0xbf803664" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="1" edc:mask="0x0fffffff" edc:regionid="devid" edc:useinchecksum="0x0fffffff" edc:value="0x0771A053">
      <edc:DEVIDToRev edc:revlist="A0" edc:value="0x00000000"/>
      <edc:DEVIDToRev edc:revlist="A1" edc:value="0x10000000"/>
      <edc:DEVIDToRev edc:revlist="A2" edc:value="0x20000000"/>
      <edc:DEVIDToRev edc:revlist="A3" edc:value="0x30000000"/>
    </edc:DeviceIDSector>
    <edc:CodeSector edc:beginaddr="0x1d000000" edc:endaddr="0x1d040000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="0" edc:kuseg="0x60000000" edc:regionid="code"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc00000" edc:endaddr="0x1fc01700" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="1" edc:regionid="bootconfig"/>
    <edc:ConfigFuseSector edc:beginaddr="0x1fc017c0" edc:endaddr="0x1fc017e8" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="1" edc:regionid="config">
      <edc:AdjustPoint edc:_addr="0x1FC017C0" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="SABD_32bit.DCRModule" edc:_refcount="1" edc:offset="0x4"/>
      <edc:DCRDef edc:_addr="0x1FC017C4" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="SABD_32bit.DCRModule" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnn---------nn---" edc:cname="FDEVOPT" edc:default="0xFFFFFFFF" edc:desc="" edc:factorydefault="0xFFFFFFFF" edc:impl="0xffffc018" edc:name="FDEVOPT" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x0000FFFF">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="SOSCHP" edc:desc="Secondary Oscillator High Power Enable bit" edc:mask="0x1" edc:name="SOSCHP" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="SOSC oprerates in high power mode" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="SOSC oprerates in normal power mode." edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ALTI2C" edc:desc="Alternate I2C1 Pins Location Enable bit" edc:mask="0x1" edc:name="ALTI2C" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Alternate I2C1 pins are used" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Primary I2C1 pins are used" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:DCRFieldDef edc:cname="FUSBIDIO" edc:desc="USBID pin control" edc:mask="0x1" edc:name="FUSBIDIO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="USBID pin is controlled by the port function" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="USBID pin is controlled by the USB module" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FVBUSIO" edc:desc="VBUS Pin Control" edc:mask="0x1" edc:name="FVBUSIO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="VBUS pin is controlled by port function" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="VBUS pin is controlled by the USB module" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="USERID" edc:desc="User ID bits" edc:mask="0xffff" edc:name="USERID" edc:nzwidth="16">
              <edc:DCRFieldValueRange edc:cname="USERID" edc:desc="User ID bits" edc:max="0xffff" edc:min="0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
