Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/edc/PIC32MM0256GPM036.PIC
      <edc:DCRDef edc:_addr="0x1FC01750" edc:_begin="0x0" edc:_end="0x24" edc:_modsrc="SABD_32bit.DCRModule" edc:_refcount="1" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="AFWDT" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xffff" edc:name="AFWDT" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xffffffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="SWDTPS" edc:desc="Sleep Mode Watchdog Timer Postscale Selection bits" edc:mask="0x1f" edc:name="SWDTPS" edc:nzwidth="5">
              <edc:DCRFieldSemantic edc:cname="PS1" edc:desc="1:1" edc:when="(field &amp; 0x1f) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="PS2" edc:desc="1:2" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PS4" edc:desc="1:4" edc:when="(field &amp; 0x1f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PS8" edc:desc="1:8" edc:when="(field &amp; 0x1f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PS16" edc:desc="1:16" edc:when="(field &amp; 0x1f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PS32" edc:desc="1:32" edc:when="(field &amp; 0x1f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PS64" edc:desc="1:64" edc:when="(field &amp; 0x1f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PS128" edc:desc="1:128" edc:when="(field &amp; 0x1f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PS256" edc:desc="1:256" edc:when="(field &amp; 0x1f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="PS512" edc:desc="1:512" edc:when="(field &amp; 0x1f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="PS1024" edc:desc="1:1024" edc:when="(field &amp; 0x1f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="PS2048" edc:desc="1:2048" edc:when="(field &amp; 0x1f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="PS4096" edc:desc="1:4096" edc:when="(field &amp; 0x1f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="PS8192" edc:desc="1:8192" edc:when="(field &amp; 0x1f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="PS16384" edc:desc="1:16384" edc:when="(field &amp; 0x1f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="PS32768" edc:desc="1:32768" edc:when="(field &amp; 0x1f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="PS65536" edc:desc="1:65536" edc:when="(field &amp; 0x17) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="PS131072" edc:desc="1:131072" edc:when="(field &amp; 0x17) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="PS262144" edc:desc="1:262144" edc:when="(field &amp; 0x17) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="PS524288" edc:desc="1:524288" edc:when="(field &amp; 0x17) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="PS1048576" edc:desc="1:1048576" edc:when="(field &amp; 0x14) == 0x14"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWDTWINSZ" edc:desc="Watchdog Timer Window Size bits" edc:mask="0x3" edc:name="FWDTWINSZ" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="PS75_0" edc:desc="Watchdog timer window size is 75%" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="PS50_0" edc:desc="Watchdog timer window size is 50%" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PS37_5" edc:desc="Watchdog timer window size is 37.5%" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PS25_0" edc:desc="Watchdog timer window size is 25%" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WINDIS" edc:desc="Windowed Watchdog Timer Disable bit" edc:mask="0x1" edc:name="WINDIS" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Watchdog timer is in window mode" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Watchdog timer is in non-window mode" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RWDTPS" edc:desc="Run Mode Watchdog Timer Postscale Selection bits" edc:mask="0x1f" edc:name="RWDTPS" edc:nzwidth="5">
              <edc:DCRFieldSemantic edc:cname="PS1" edc:desc="1:1" edc:when="(field &amp; 0x1f) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="PS2" edc:desc="1:2" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PS4" edc:desc="1:4" edc:when="(field &amp; 0x1f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PS8" edc:desc="1:8" edc:when="(field &amp; 0x1f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PS16" edc:desc="1:16" edc:when="(field &amp; 0x1f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PS32" edc:desc="1:32" edc:when="(field &amp; 0x1f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PS64" edc:desc="1:64" edc:when="(field &amp; 0x1f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PS128" edc:desc="1:128" edc:when="(field &amp; 0x1f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PS256" edc:desc="1:256" edc:when="(field &amp; 0x1f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="PS512" edc:desc="1:512" edc:when="(field &amp; 0x1f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="PS1024" edc:desc="1:1024" edc:when="(field &amp; 0x1f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="PS2048" edc:desc="1:2048" edc:when="(field &amp; 0x1f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="PS4096" edc:desc="1:4096" edc:when="(field &amp; 0x1f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="PS8192" edc:desc="1:8192" edc:when="(field &amp; 0x1f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="PS16384" edc:desc="1:16384" edc:when="(field &amp; 0x1f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="PS32768" edc:desc="1:32768" edc:when="(field &amp; 0x1f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="PS65536" edc:desc="1:65536" edc:when="(field &amp; 0x17) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="PS131072" edc:desc="1:131072" edc:when="(field &amp; 0x17) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="PS262144" edc:desc="1:262144" edc:when="(field &amp; 0x17) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="PS524288" edc:desc="1:524288" edc:when="(field &amp; 0x17) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="PS1048576" edc:desc="1:1048576" edc:when="(field &amp; 0x14) == 0x14"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RCLKSEL" edc:desc="Run Mode Watchdog Timer Clock Source Selection bits" edc:mask="0x3" edc:name="RCLKSEL" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="SYSCLK" edc:desc="Clock source is system clock" edc:when="(field &amp; 0x2) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="Clock source is FRC oscillator" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="Clock source is LPRC (same as for sleep mode)" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWDTEN" edc:desc="Watchdog Timer Enable bit" edc:mask="0x1" edc:name="FWDTEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="WDT is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="WDT is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
