Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPM_DFP/1.3.50/edc/PIC32MM0256GPM036.PIC
      <edc:SFRDef edc:_addr="0x1F800230" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="2" edc:access="-----------nnnnn-----n--rnnccrcr" edc:cname="CCP2STAT" edc:desc="" edc:impl="0x301f14ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------00000-----0--00000000" edc:name="CCP2STAT" edc:nzwidth="0x20" edc:por="-----------00000-----0--00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ICBNE" edc:desc="" edc:mask="0x1" edc:name="ICBNE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ICOV" edc:desc="" edc:mask="0x1" edc:name="ICOV" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ICDIS" edc:desc="" edc:mask="0x1" edc:name="ICDIS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SCEVT" edc:desc="" edc:mask="0x1" edc:name="SCEVT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ASEVT" edc:desc="" edc:mask="0x1" edc:name="ASEVT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRCLR" edc:desc="" edc:mask="0x1" edc:name="TRCLR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRSET" edc:desc="" edc:mask="0x1" edc:name="TRSET" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CCPTRIG" edc:desc="" edc:mask="0x1" edc:name="CCPTRIG" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ICGARM" edc:desc="" edc:mask="0x1" edc:name="ICGARM" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RAWIP" edc:desc="" edc:mask="0x1" edc:name="RAWIP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RBWIP" edc:desc="" edc:mask="0x1" edc:name="RBWIP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TMRLWIP" edc:desc="" edc:mask="0x1" edc:name="TMRLWIP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TMRHWIP" edc:desc="" edc:mask="0x1" edc:name="TMRHWIP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PRLWIP" edc:desc="" edc:mask="0x1" edc:name="PRLWIP" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800240" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCP2TMR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CCP2TMR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TMRL" edc:desc="" edc:mask="0xffff" edc:name="TMRL" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="TMRH" edc:desc="" edc:mask="0xffff" edc:name="TMRH" edc:nzwidth="16"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0xffffffff" edc:name="TMR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800250" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CCP2PR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CCP2PR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PRL" edc:desc="" edc:mask="0xffff" edc:name="PRL" edc:nzwidth="16"/>
            <edc:SFRFieldDef edc:cname="PRH" edc:desc="" edc:mask="0xffff" edc:name="PRH" edc:nzwidth="16"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="PR" edc:desc="" edc:mask="0xffffffff" edc:name="PR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800260" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="2" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CCP2RA" edc:desc="" edc:impl="0x3000ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CCP2RA" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMPA" edc:desc="" edc:mask="0xffff" edc:name="CMPA" edc:nzwidth="16"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800270" edc:_begin="0x0" edc:_end="0x90" edc:_modsrc="DOS-01512_ccp_mccp_upb_v1_32bit.Module" edc:_refcount="2" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CCP2RB" edc:desc="" edc:impl="0x3000ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CCP2RB" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CCP2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMPB" edc:desc="" edc:mask="0xffff" edc:name="CMPB" edc:nzwidth="16"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
